app/controllers/users_controller.rb

  def destroy
    @user = User.find_by_url(params[:id])
    if @user.nil?
      @user = User.find(params[:id])
---
SELECT * FROM "users" WHERE ("users"."id" = 980190962)

  def show
  	@users = User.all
    @user = User.find_by_url(params[:id])
    if @user.nil?
      @user = User.find(params[:id])
---
SELECT * FROM "users" WHERE ("users"."id" = 980190962)