app/controllers/words_controller.rb

  def index
  	@random = Word.random
  	@random_def = @random.definitions.find :first
---
SELECT * FROM "words"